app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "last_name", "persistence_token", "login_count", "last_login_ip", "last_login_at", "first_name", "email") VALUES('bXeGpaMQbPqDR1M5ynaY', '2010-04-04 00:25:28', '2010-04-04 00:25:28', '877ee899334fa850f84bd20e88189eceb012ae304566e6458e93d0404d51fe713348bc1a34508dd526d766ba0737aca021503a454eda80009a89741964069d46', '1skJwQxH-hJgOGQjyLVz', '2010-04-04 00:25:28', 0, '127.0.0.1', 'I8IicoYFIocUNGIDiob1', '2010-04-04 00:25:28', NULL, '9172a1f5cdc76af026c284af76f78c4792e691e3eb4aa82e8c40850dab2216a2104923be3fdd55ba486e86e43e09a22138064f9560f14fc476b3710d424c7846', 1, NULL, NULL, NULL, 'fabien.legoupillot@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def edit
    @title = "Edit Profile"
    @user = User.find(params[:id])